; domain
(define (domain rescue-drone)

    (:requirements :strips :negative-preconditions)

    (:predicates
        (drone-location ?d) ; Represents that the drone is at location ?d
        (person-location ?p ?d) ; Represents that the person ?p is at location ?d
        (obstacle ?d) ; Represents that there is an obstacle at location ?d
        (safe-zone ?d) ; Represents that location ?d is the safe zone
        (adjacent ?d1 ?d2) ; Represents that locations ?d1 and ?d2 are adjacent
        (rescued ?p) ; Represents that the person p has been rescued and is now in the safe zone
        (on-drone ?p) ; Represents that the person p is on the drone
        (drone-occupied); represents that the drone is currently carrying someone
        (spot ?s) ; Represents a valid spot in the safe zone
        (free-spot ?s) ; Represents that the spot ?s in the safe zone is free
    )

    (:action move
        :parameters (?d1 ?d2)

        :precondition (and
            (adjacent ?d1 ?d2)
            (not (obstacle ?d2))
            (drone-location ?d1)
        )

        :effect (and
            (drone-location ?d2)
            (not (drone-location ?d1))
        )
    )

    (:action pick-up
        :parameters (?p ?d)

        :precondition (and
            (person-location ?p ?d)
            (not (rescued ?p))
            (drone-location ?d)
            (not (drone-occupied))
        )

        :effect (and
            (on-drone ?p)
            (not (person-location ?p ?d))
            (drone-occupied)
        ) ; Note the we don't consider the person position to be d after being picked up.
    )

    (:action drop-off
        :parameters (?p ?sd ?s) ; sd for safe-zone position, s for spot

        :precondition (and
            (on-drone ?p)
            (safe-zone ?sd)
            (drone-location ?sd)
            (free-spot ?s)
            (spot ?s)
        )

        :effect (and
            (rescued ?p)
            (not (on-drone ?p))
            (not (drone-occupied))
            (not (free-spot ?s))
        )
    )

    ; Free a spot in the safe zone
    (:action free-safe-zone
        :parameters (?s)

        :precondition (and
            (not (free-spot ?s))
            (spot ?s)
        )

        :effect (free-spot ?s)
    )
)

; problem
(define (problem rescue-drone-problem-5x5)
    (:domain rescue-drone)

    (:objects
        d1 d2 d3 d4 d5 d6 d7 d8 d9 d10 d11 d12 d13 d14 d15 d16 d17 d18 d19 d20 d21 d22 d23 d24 d25 ; Locations
        p1 p2 p3 p4 p5 p6 ; Persons
        s1 s2 s3 s4 ; Spots
        )

    (:init
        (drone-location d11)
        (person-location p1 d3)
        (person-location p2 d7)
        (person-location p3 d12)
        (person-location p4 d16)
        (person-location p5 d20)
        (person-location p6 d24)
        (safe-zone d25)

        ;; Define adjacencies for a 5x5 grid
        (adjacent d1 d2)
        (adjacent d1 d6)
        (adjacent d2 d1)
        (adjacent d2 d3)
        (adjacent d2 d7)
        (adjacent d3 d2)
        (adjacent d3 d4)
        (adjacent d3 d8)
        (adjacent d4 d3)
        (adjacent d4 d5)
        (adjacent d4 d9)
        (adjacent d5 d4)
        (adjacent d5 d10)

        (adjacent d6 d1)
        (adjacent d6 d7)
        (adjacent d6 d11)
        (adjacent d7 d2)
        (adjacent d7 d6)
        (adjacent d7 d8)
        (adjacent d7 d12)
        (adjacent d8 d3)
        (adjacent d8 d7)
        (adjacent d8 d9)
        (adjacent d8 d13)
        (adjacent d9 d4)
        (adjacent d9 d8)
        (adjacent d9 d10)
        (adjacent d9 d14)
        (adjacent d10 d5)
        (adjacent d10 d9)
        (adjacent d10 d15)

        (adjacent d11 d6)
        (adjacent d11 d12)
        (adjacent d11 d16)
        (adjacent d12 d7)
        (adjacent d12 d11)
        (adjacent d12 d13)
        (adjacent d12 d17)
        (adjacent d13 d8)
        (adjacent d13 d12)
        (adjacent d13 d14)
        (adjacent d13 d18)
        (adjacent d14 d9)
        (adjacent d14 d13)
        (adjacent d14 d15)
        (adjacent d14 d19)
        (adjacent d15 d10)
        (adjacent d15 d14)
        (adjacent d15 d20)

        (adjacent d16 d11)
        (adjacent d16 d17)
        (adjacent d16 d21)
        (adjacent d17 d12)
        (adjacent d17 d16)
        (adjacent d17 d18)
        (adjacent d17 d22)
        (adjacent d18 d13)
        (adjacent d18 d17)
        (adjacent d18 d19)
        (adjacent d18 d23)
        (adjacent d19 d14)
        (adjacent d19 d18)
        (adjacent d19 d20)
        (adjacent d19 d24)
        (adjacent d20 d15)
        (adjacent d20 d19)
        (adjacent d20 d25)

        (adjacent d21 d16)
        (adjacent d21 d22)
        (adjacent d22 d17)
        (adjacent d22 d21)
        (adjacent d22 d23)
        (adjacent d23 d18)
        (adjacent d23 d22)
        (adjacent d23 d24)
        (adjacent d24 d19)
        (adjacent d24 d23)
        (adjacent d24 d25)
        (adjacent d25 d20)
        (adjacent d25 d24)

        ;; Obstacles
        (obstacle d2)
        (obstacle d5)
        (obstacle d9)
        (obstacle d13)
        (obstacle d21)

        ;; Safe-zone spots
        (spot s1)
        (spot s2)
        (spot s3)
        (spot s4)
        (free-spot s1)
        (free-spot s2)
        (free-spot s3)
        (free-spot s4)
    )

    (:goal
        (and
            (rescued p1)
            (rescued p2)
            (rescued p3)
            (rescued p4)
            (rescued p5)
            (rescued p6)
        )
    )
)

; plan
1. (move d11 d12)
   deleted: (drone-location d11)
   added: (drone-location d12)
   goals met: 0 of 6
2. (move d12 d7)
   deleted: (drone-location d12)
   added: (drone-location d7)
   goals met: 0 of 6
3. (move d7 d8)
   deleted: (drone-location d7)
   added: (drone-location d8)
   goals met: 0 of 6
4. (move d8 d3)
   deleted: (drone-location d8)
   added: (drone-location d3)
   goals met: 0 of 6
5. (pick-up p1 d3)
   deleted: (person-location p1 d3)
   added: (on-drone p1) (drone-occupied)
   goals met: 0 of 6
6. (move d3 d8)
   deleted: (drone-location d3)
   added: (drone-location d8)
   goals met: 0 of 6
7. (move d8 d7)
   deleted: (drone-location d8)
   added: (drone-location d7)
   goals met: 0 of 6
8. (move d7 d12)
   deleted: (drone-location d7)
   added: (drone-location d12)
   goals met: 0 of 6
9. (move d12 d17)
   deleted: (drone-location d12)
   added: (drone-location d17)
   goals met: 0 of 6
10. (move d17 d18)
   deleted: (drone-location d17)
   added: (drone-location d18)
   goals met: 0 of 6
11. (move d18 d19)
   deleted: (drone-location d18)
   added: (drone-location d19)
   goals met: 0 of 6
12. (move d19 d20)
   deleted: (drone-location d19)
   added: (drone-location d20)
   goals met: 0 of 6
13. (move d20 d25)
   deleted: (drone-location d20)
   added: (drone-location d25)
   goals met: 0 of 6
14. (drop-off p1 d25 s1)
   deleted: (on-drone p1) (drone-occupied) (free-spot s1)
   added: (rescued p1)
   goals met: 1 of 6
15. (move d25 d20)
   deleted: (drone-location d25)
   added: (drone-location d20)
   goals met: 1 of 6
16. (move d20 d19)
   deleted: (drone-location d20)
   added: (drone-location d19)
   goals met: 1 of 6
17. (move d19 d18)
   deleted: (drone-location d19)
   added: (drone-location d18)
   goals met: 1 of 6
18. (move d18 d17)
   deleted: (drone-location d18)
   added: (drone-location d17)
   goals met: 1 of 6
19. (move d17 d12)
   deleted: (drone-location d17)
   added: (drone-location d12)
   goals met: 1 of 6
20. (move d12 d7)
   deleted: (drone-location d12)
   added: (drone-location d7)
   goals met: 1 of 6
21. (pick-up p2 d7)
   deleted: (person-location p2 d7)
   added: (on-drone p2) (drone-occupied)
   goals met: 1 of 6
22. (move d7 d12)
   deleted: (drone-location d7)
   added: (drone-location d12)
   goals met: 1 of 6
23. (move d12 d17)
   deleted: (drone-location d12)
   added: (drone-location d17)
   goals met: 1 of 6
24. (move d17 d18)
   deleted: (drone-location d17)
   added: (drone-location d18)
   goals met: 1 of 6
25. (move d18 d19)
   deleted: (drone-location d18)
   added: (drone-location d19)
   goals met: 1 of 6
26. (move d19 d20)
   deleted: (drone-location d19)
   added: (drone-location d20)
   goals met: 1 of 6
27. (move d20 d25)
   deleted: (drone-location d20)
   added: (drone-location d25)
   goals met: 1 of 6
28. (drop-off p2 d25 s2)
   deleted: (on-drone p2) (drone-occupied) (free-spot s2)
   added: (rescued p2)
   goals met: 2 of 6
29. (move d25 d20)
   deleted: (drone-location d25)
   added: (drone-location d20)
   goals met: 2 of 6
30. (move d20 d19)
   deleted: (drone-location d20)
   added: (drone-location d19)
   goals met: 2 of 6
31. (move d19 d18)
   deleted: (drone-location d19)
   added: (drone-location d18)
   goals met: 2 of 6
32. (move d18 d17)
   deleted: (drone-location d18)
   added: (drone-location d17)
   goals met: 2 of 6
33. (move d17 d12)
   deleted: (drone-location d17)
   added: (drone-location d12)
   goals met: 2 of 6
34. (pick-up p3 d12)
   deleted: (person-location p3 d12)
   added: (on-drone p3) (drone-occupied)
   goals met: 2 of 6
35. (move d12 d17)
   deleted: (drone-location d12)
   added: (drone-location d17)
   goals met: 2 of 6
36. (move d17 d18)
   deleted: (drone-location d17)
   added: (drone-location d18)
   goals met: 2 of 6
37. (move d18 d19)
   deleted: (drone-location d18)
   added: (drone-location d19)
   goals met: 2 of 6
38. (move d19 d20)
   deleted: (drone-location d19)
   added: (drone-location d20)
   goals met: 2 of 6
39. (move d20 d25)
   deleted: (drone-location d20)
   added: (drone-location d25)
   goals met: 2 of 6
40. (drop-off p3 d25 s3)
   deleted: (on-drone p3) (drone-occupied) (free-spot s3)
   added: (rescued p3)
   goals met: 3 of 6
41. (move d25 d20)
   deleted: (drone-location d25)
   added: (drone-location d20)
   goals met: 3 of 6
42. (move d20 d19)
   deleted: (drone-location d20)
   added: (drone-location d19)
   goals met: 3 of 6
43. (move d19 d18)
   deleted: (drone-location d19)
   added: (drone-location d18)
   goals met: 3 of 6
44. (move d18 d17)
   deleted: (drone-location d18)
   added: (drone-location d17)
   goals met: 3 of 6
45. (move d17 d16)
   deleted: (drone-location d17)
   added: (drone-location d16)
   goals met: 3 of 6
46. (pick-up p4 d16)
   deleted: (person-location p4 d16)
   added: (on-drone p4) (drone-occupied)
   goals met: 3 of 6
47. (move d16 d17)
   deleted: (drone-location d16)
   added: (drone-location d17)
   goals met: 3 of 6
48. (move d17 d18)
   deleted: (drone-location d17)
   added: (drone-location d18)
   goals met: 3 of 6
49. (move d18 d19)
   deleted: (drone-location d18)
   added: (drone-location d19)
   goals met: 3 of 6
50. (move d19 d20)
   deleted: (drone-location d19)
   added: (drone-location d20)
   goals met: 3 of 6
51. (move d20 d25)
   deleted: (drone-location d20)
   added: (drone-location d25)
   goals met: 3 of 6
52. (drop-off p4 d25 s4)
   deleted: (on-drone p4) (drone-occupied) (free-spot s4)
   added: (rescued p4)
   goals met: 4 of 6
53. (free-safe-zone s1)
   added: (free-spot s1)
   goals met: 4 of 6
54. (move d25 d20)
   deleted: (drone-location d25)
   added: (drone-location d20)
   goals met: 4 of 6
55. (pick-up p5 d20)
   deleted: (person-location p5 d20)
   added: (on-drone p5) (drone-occupied)
   goals met: 4 of 6
56. (move d20 d25)
   deleted: (drone-location d20)
   added: (drone-location d25)
   goals met: 4 of 6
57. (drop-off p5 d25 s1)
   deleted: (on-drone p5) (drone-occupied) (free-spot s1)
   added: (rescued p5)
   goals met: 5 of 6
58. (free-safe-zone s1)
   added: (free-spot s1)
   goals met: 5 of 6
59. (move d25 d24)
   deleted: (drone-location d25)
   added: (drone-location d24)
   goals met: 5 of 6
60. (pick-up p6 d24)
   deleted: (person-location p6 d24)
   added: (on-drone p6) (drone-occupied)
   goals met: 5 of 6
61. (move d24 d25)
   deleted: (drone-location d24)
   added: (drone-location d25)
   goals met: 5 of 6
62. (drop-off p6 d25 s1)
   deleted: (on-drone p6) (drone-occupied) (free-spot s1)
   added: (rescued p6)
   goals met: 6 of 6
